# Assignment-05 MD Rashadul Islam

In [1]:
import pandas as pd
import numpy as np

In [2]:
import os

In [3]:
os.getcwd()

'C:\\Users\\Hp\\J Notebook Work'

In [4]:
df = pd.read_csv("insurance.csv")
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [5]:
df.isnull().sum()

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [6]:
df.sex.value_counts()

male      676
female    662
Name: sex, dtype: int64

In [7]:
df.smoker.value_counts()

no     1064
yes     274
Name: smoker, dtype: int64

In [8]:
df.region.value_counts()

southeast    364
southwest    325
northwest    325
northeast    324
Name: region, dtype: int64

In [9]:
df2= df.copy()
df3= df.copy()
df4= df.copy()
df5= df.copy()

# Replace

In [10]:
df.sex = df.sex.replace(['female','male'],[1,2])
df.smoker = df.smoker.replace(['yes','no'],[1,0])
df.region = df.region.replace(['southeast','southwest','northwest','northeast'],[4,3,2,1])
df.head()

   age  sex     bmi  children  smoker  region      charges
0   19    1  27.900         0       1       3  16884.92400
1   18    2  33.770         1       0       4   1725.55230
2   28    2  33.000         3       0       4   4449.46200
3   33    2  22.705         0       0       2  21984.47061
4   32    2  28.880         0       0       2   3866.85520

Replacing all the name into numerical format

# Label Encoder

In [11]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [12]:
df2.sex=le.fit_transform(df2.sex)
df2.smoker=le.fit_transform(df2.smoker)
df2.region=le.fit_transform(df2.region)
df2.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# Label Encoder (LOOP)

In [13]:
from sklearn.preprocessing import LabelEncoder
le=LabelEncoder()

In [14]:
df3.columns

Index(['age', 'sex', 'bmi', 'children', 'smoker', 'region', 'charges'], dtype='object')

In [15]:
for (columnName, columnData) in df3.items():
    if(df3[columnName].dtype == 'object'):
        df3[columnName] = le.fit_transform(df3[columnName])
df3.head()

   age  sex     bmi  children  smoker  region      charges
0   19    0  27.900         0       1       3  16884.92400
1   18    1  33.770         1       0       2   1725.55230
2   28    1  33.000         3       0       2   4449.46200
3   33    1  22.705         0       0       1  21984.47061
4   32    1  28.880         0       0       1   3866.85520

# One Hot Encoding

In [16]:
from sklearn.preprocessing import OneHotEncoder
oh=OneHotEncoder()

In [17]:
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [18]:
for (columnName, columnData) in df4.items():
    if(df4[columnName].dtype == 'object'):
        one = pd.get_dummies(df4[columnName], drop_first=True, prefix='One_Hot_'+columnName)
        df4.drop(df4[[columnName]], axis=1,inplace=True)
        df4=pd.concat([df4,one], axis=1)
df4.head()

,age,bmi,children,charges,One_Hot_sex_male,One_Hot_smoker_yes,One_Hot_region_northwest,One_Hot_region_southeast,One_Hot_region_southwest
0,19,27.900,0,16884.92400,0,1,0,0,1
1,18,33.770,1,1725.55230,1,0,0,1,0
2,28,33.000,3,4449.46200,1,0,0,1,0
3,33,22.705,0,21984.47061,1,0,1,0,0
4,32,28.880,0,3866.85520,1,0,1,0,0

# Ordinal

In [19]:
from sklearn.preprocessing import OrdinalEncoder

In [20]:
for (columnName, columnData) in df5.items():
    if(df5[columnName].dtype == 'object'):
        col_unq_val = df5[columnName].unique()
        ordinal = OrdinalEncoder(categories=[col_unq_val])
        encoded = ordinal.fit_transform(df5[[columnName]])
        df5[columnName] = encoded
df5.head()

   age  sex     bmi  children  smoker  region      charges
0   19  0.0  27.900         0     0.0     0.0  16884.92400
1   18  1.0  33.770         1     1.0     1.0   1725.55230
2   28  1.0  33.000         3     1.0     1.0   4449.46200
3   33  1.0  22.705         0     1.0     2.0  21984.47061
4   32  1.0  28.880         0     1.0     2.0   3866.85520